BigZ2000/gbairai/tools/firmware-esp32/gbairai_buzzer/gbairai_buzzer.ino
/* ============================================================================
 *  GBAIRAI — Firmware Buzzer ESP32
 * ----------------------------------------------------------------------------
 *  Parle EXACTEMENT le même protocole que le simulateur (tools/buzzer-simulator) :
 *
 *   Montant (device → serveur) :
 *     { "type":"buzzer_hello", "mac":"AA:BB:CC:DD:EE:FF", "firmware":"esp32-1.0" }
 *     { "type":"buzz", "source":"device", "mac":"AA:BB:CC:DD:EE:FF" }
 *
 *   Descendant (serveur → device) — pilote la LED :
 *     { "type":"awaiting_claim" }                       → à appairer
 *     { "type":"pairing_success" }                      → appairé
 *     { "type":"led", "state":"armed|winner|locked|reveal|idle" }
 *
 *  Le buzzer ne connaît NI le code de la partie, NI de room : le serveur résout
 *  tout via l'attribution et lui pousse l'état de sa LED.
 *
 *  Dépendances (Arduino Library Manager) :
 *     - WiFiManager            (tzapu)            → captive portal Wi-Fi
 *     - WebSockets             (Markus Sattler / links2004)
 *     - Adafruit NeoPixel      (LED RGB d'état)
 *
 *  Carte : "ESP32 Dev Module" (esp32 by Espressif).
 * ========================================================================== */

#include <WiFi.h>
#include <WiFiManager.h>          // https://github.com/tzapu/WiFiManager
#include <WebSocketsClient.h>     // https://github.com/Links2004/arduinoWebSockets
#include <Adafruit_NeoPixel.h>
#include <Preferences.h>
#include <HTTPUpdate.h>           // OTA (mise à jour par HTTP/HTTPS)
#include <WiFiClient.h>
#include <WiFiClientSecure.h>     // OTA en HTTPS (binaire servi par le serveur Gbairai)

// ── Brochage (adapter selon ton câblage) ────────────────────────────────────
// Bouton arcade 4 broches : COM + NO = microswitch, LED+ / LED− = anneau lumineux.
//   COM → GND            |  NO → GPIO13 (BUTTON_PIN, INPUT_PULLUP)
//   LED− → GND           |  LED+ → via transistor commandé par GPIO14 (voir §Câblage)
// ⚠️ La LED de l'anneau (5 V, souvent 20–40 mA) ne doit JAMAIS être branchée en
// direct sur un GPIO (3,3 V / 12 mA conseillés) : passer par un transistor
// (NPN 2N2222 / BC547, ou MOSFET 2N7000) en commutation « côté bas ».
#define BUTTON_PIN     13        // microswitch : NO → GPIO13, COM → GND
#define BUTTON_LED_PIN 14        // anneau du bouton (via transistor). -1 pour désactiver.
#define LED_PIN        5         // entrée DATA d'une LED WS2812 (NeoPixel)
#define LED_COUNT      7
#define BUZZER_PIN     12        // piézo (sortie son) — mêmes déclencheurs que le simulateur
#define BATTERY_PIN    34        // mesure batterie via pont diviseur (entrée ADC)
#define FIRMWARE_VERSION "esp32-1.3"
#define TELEMETRY_MS 30000UL     // télémétrie toutes les 30 s

// Canaux PWM (LEDC) — le piézo utilise tone() qui réserve le canal 0.
#define BTN_LED_CHANNEL 4
#define BTN_LED_FREQ    5000
#define BTN_LED_RES     8        // 8 bits → 0..255

// Reset d'usine par appui long EN FONCTIONNEMENT (plus découvrable que le
// « bouton tenu au démarrage », qui reste supporté).
#define LONG_PRESS_RESET_MS 10000UL

// ── Objets globaux ──────────────────────────────────────────────────────────
WebSocketsClient webSocket;
Adafruit_NeoPixel pixel(LED_COUNT, LED_PIN, NEO_GRB + NEO_KHZ800);
Preferences prefs;

String gMac;                      // "AA:BB:CC:DD:EE:FF"
// Serveur Gbairai CODÉ EN DUR : l'utilisateur ne saisit QUE son Wi-Fi (plug & play,
// zéro réglage technique). Déploiement LAN/dev : remplacer ces 2 valeurs puis
// reflasher (ex. "192.168.1.10" / 4000 → liaison ws:// claire).
const char*    GBAIRAI_HOST = "api.gbairai.robotechci.com";
const uint16_t GBAIRAI_PORT = 443;   // 443 → wss (TLS) auto ; 4000 → ws (LAN)
bool gConnected = false;

// ── États de LED (miroir exact du simulateur) ───────────────────────────────
enum LedState { L_OFFLINE, L_PORTAL, L_AWAITING, L_READY, L_ARMED, L_WINNER, L_LOCKED, L_REVEAL, L_PRESSED };

// Une note du séquenceur audio. freq = 0 → silence (articulation entre deux notes).
// Défini ici, avant toute fonction, pour que les prototypes générés par Arduino
// (qui référencent `const Note*`) voient bien le type.
struct Note { uint16_t freq; uint16_t ms; };
LedState  gLed = L_OFFLINE;
uint32_t  gFlashUntil = 0;        // flash blanc local lors de l'appui

// ── Anti-rebond bouton ──────────────────────────────────────────────────────
int  gLastBtn = HIGH;
uint32_t gLastBtnMs = 0;

// ── Télémétrie ──────────────────────────────────────────────────────────────
uint32_t gLastTelemetryMs = 0;
WiFiClient gOtaClient;

// Vrai si CE boot suit un reset d'usine (bouton tenu OU commande serveur) —
// lu une fois depuis les prefs au démarrage, annoncé au hello puis consommé.
bool gJustFactoryReset = false;

// Appui long en fonctionnement (reset d'usine) : instant du début d'appui.
uint32_t gPressStartMs = 0;
uint8_t  gLastResetTickSec = 0;   // dernière seconde « tictée » du décompte sonore
// Progression OTA (0..100, -1 = pas de MAJ en cours) → retour visuel dédié.
int gOtaProgress = -1;

bool inGame() { return gLed == L_ARMED || gLed == L_WINNER || gLed == L_LOCKED || gLed == L_REVEAL; }

// Niveau de batterie en % (à calibrer selon ton pont diviseur).
// Hypothèse : pont /2, LiPo 3,3 V (0 %) → 4,2 V (100 %).
int readBatteryPercent() {
  uint32_t raw = 0;
  for (int i = 0; i < 8; i++) raw += analogRead(BATTERY_PIN);
  float v = (raw / 8.0) / 4095.0 * 3.3 * 2.0;        // tension batterie estimée
  int pct = (int)((v - 3.3) / (4.2 - 3.3) * 100.0);
  return constrain(pct, 0, 100);
}

// ============================================================================
//  LED : rendu non-bloquant (animations via millis())
// ============================================================================
uint32_t rgb(uint8_t r, uint8_t g, uint8_t b) { return pixel.Color(r, g, b); }

// Applique une couleur à TOUT le bandeau (LED_COUNT pixels) puis rafraîchit.
// ⚠️ Ne jamais adresser le seul pixel 0 : avec un bandeau, les autres resteraient
// éteints (leur tampon vaut 0). Tous les rendus passent par ici.
void setAll(uint32_t color) {
  for (uint16_t i = 0; i < LED_COUNT; i++) pixel.setPixelColor(i, color);
  pixel.show();
}

