BigZ2000/gbairai/tools/firmware-esp32/gbairai_buzzer/gbairai_buzzer.ino
// Anneau lumineux du bouton arcade (LED simple, donc uniquement une intensité).
// Piloté en PWM pour reproduire les mêmes rythmes que la NeoPixel : le joueur
// voit le BOUTON lui-même s'allumer, ce qui est bien plus lisible à distance.
// NB : l'API LEDC diffère entre les cores ESP32 2.x (canal) et 3.x (broche).
// La garde ci-dessous évite une casse silencieuse si le core est mis à jour.
void setButtonLed(uint8_t level) {
#if BUTTON_LED_PIN >= 0
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcWrite(BUTTON_LED_PIN, level);
  #else
    ledcWrite(BTN_LED_CHANNEL, level);
  #endif
#endif
}

void renderLed() {
  uint32_t now = millis();

  // Mise à jour OTA en cours : priorité absolue, la barre de progression se lit
  // sur l'intensité de l'anneau et la NeoPixel passe en bleu clignotant.
  if (gOtaProgress >= 0) {
    // Le bandeau se remplit au fil du téléchargement : N pixels allumés sur 7.
    uint16_t remplis = (uint16_t)((uint32_t)gOtaProgress * LED_COUNT / 100);
    for (uint16_t i = 0; i < LED_COUNT; i++)
      pixel.setPixelColor(i, i < remplis ? rgb(0, 80, 255) : rgb(0, 8, 30));
    pixel.show();
    setButtonLed((uint8_t)(gOtaProgress * 255 / 100)); // l'anneau suit aussi la progression
    return;
  }

  // Flash blanc prioritaire (retour tactile immédiat à l'appui).
  if (now < gFlashUntil) {
    setAll(rgb(255, 255, 255));
    setButtonLed(255);
    return;
  }

  // Respiration : 0..255 sinusoïdal lent.
  float phase = (sin(now / 350.0) + 1.0) / 2.0;     // 0..1
  uint8_t breath = 40 + (uint8_t)(phase * 180);

  // L'anneau reprend le rythme de l'état courant (allumé/pulsé/éteint).
  switch (gLed) {
    case L_OFFLINE:  setButtonLed(breath / 6); break;   // très faible, respire
    case L_PORTAL:   setButtonLed(breath); break;       // pulse franchement (à configurer)
    case L_AWAITING: setButtonLed(breath); break;       // pulse (à appairer)
    case L_READY:    setButtonLed(30); break;           // veilleuse discrète
    case L_ARMED:    setButtonLed(255); break;          // PLEIN FEU : « tu peux buzzer »
    case L_WINNER:   setButtonLed(255); break;
    case L_LOCKED:   setButtonLed(0); break;            // éteint : verrouillé
    case L_REVEAL:   setButtonLed(120); break;
    case L_PRESSED:  setButtonLed(255); break;
  }

  // Couleurs calibrées pour rester DISTINCTES à la luminosité réduite d'un
  // bandeau (90/255) : les états volontairement discrets (prêt, hors ligne)
  // étaient quasi invisibles avec les anciennes valeurs très basses.
  switch (gLed) {
    case L_OFFLINE:  setAll(rgb(breath/2, 0, 0)); break;                            // rouge sombre pulsé
    case L_PORTAL:   setAll(rgb(breath, breath, breath)); break;                    // blanc pulsé (config)
    case L_AWAITING: setAll(rgb(breath, (uint8_t)(breath*0.55), 0)); break;         // ambre pulsé
    case L_READY:    setAll(rgb(0, 90, 35)); break;                                 // vert doux stable (prêt)
    case L_ARMED:    setAll(rgb(0, (uint8_t)(breath*0.45), breath)); break;         // bleu pulsé
    case L_WINNER:   setAll(rgb(0, 235, 70)); break;                                // vert vif
    case L_LOCKED:   setAll(rgb(190, 0, 0)); break;                                 // rouge franc
    case L_REVEAL:   setAll(rgb(245, 130, 0)); break;                               // orange
    case L_PRESSED:  setAll(rgb(255, 255, 255)); break;
  }
}

// ============================================================================
//  SON — séquenceur de mélodies NON BLOQUANT
// ----------------------------------------------------------------------------
//  Les anciennes mélodies enchaînaient des `delay()` : jusqu'à 240 ms pendant
//  lesquelles webSocket.loop(), le bouton et la LED étaient gelés — inacceptable
//  sur un buzzer où le temps de réaction est l'essence du jeu. Le séquenceur
//  ci-dessous avance à chaque tour de loop() via millis().
//
//  Deux modes :
//    • playMelody()    → non bloquant, pour tout ce qui arrive EN JEU.
//    • playMelodyNow() → bloquant, réservé aux phases où loop() ne tourne pas
//                        de toute façon (démarrage, portail Wi-Fi, OTA, reset).
// ============================================================================

// Gamme de do majeur — les mélodies partagent le même vocabulaire pour former
// une famille sonore cohérente plutôt qu'une collection de bips au hasard.
#define N_C4  262
#define N_F4  349
#define N_G4  392
#define N_A4  440
#define N_G3  196
#define N_A3  220
#define N_C5  523
#define N_E5  659
#define N_F5  698
#define N_G5  784
#define N_A5  880
#define N_C6 1047
#define N_E6 1319
#define N_G6 1568
#define SIL     0        // silence

#define MEL(x) x, (uint8_t)(sizeof(x) / sizeof((x)[0]))

// ── Palette : une intention par évènement ───────────────────────────────────
static const Note melBoot[]     = {{N_C5,60},{N_E5,60},{N_G5,80}};                              // réveil
static const Note melPortal[]   = {{N_G5,100},{SIL,60},{N_C6,170}};                             // « configure-moi »
static const Note melWifiOk[]   = {{N_C5,70},{N_G5,120}};                                       // Wi-Fi obtenu
static const Note melWsConnect[]= {{N_E5,60},{N_A5,90}};                                        // serveur joint
static const Note melOffline[]  = {{N_G5,100},{N_E5,100},{N_C5,190}};                           // liaison perdue
static const Note melAwaiting[] = {{N_E5,90},{SIL,50},{N_A5,110}};                              // question : « appaire-moi ? »
static const Note melPaired[]   = {{N_C5,70},{N_E5,70},{N_G5,70},{N_C6,150}};                   // résolution joyeuse
static const Note melReady[]    = {{N_G4,45}};                                                  // veilleuse, très discret
static const Note melArmed[]    = {{N_A5,45},{SIL,35},{N_C6,60}};                               // double tic : « à toi ! »
static const Note melPress[]    = {{N_C6,40}};                                                  // impact sec de l'appui
static const Note melWinner[]   = {{N_G5,110},{N_C6,110},{N_E6,110},{SIL,40},{N_G6,230}};       // fanfare
static const Note melLocked[]   = {{N_A3,120},{SIL,40},{N_G3,230}};                             // grave, « trop tard »
static const Note melReveal[]   = {{N_F5,90},{SIL,50},{N_F5,130}};                              // notification neutre
static const Note melOtaStart[] = {{N_C5,70},{N_E5,70},{N_G5,70},{N_C6,70}};                    // « travaux en cours »
static const Note melOtaOk[]    = {{N_C6,90},{N_E6,90},{N_G6,210}};                             // MAJ réussie
static const Note melOtaFail[]  = {{N_E5,140},{SIL,40},{N_C5,140},{SIL,40},{N_A4,260}};         // MAJ échouée
static const Note melResetDone[]= {{N_C5,90},{N_A4,90},{N_F4,90},{N_C4,260}};                   // effacement

