BigZ2000/gbairai/tools/firmware-esp32/gbairai_buzzer/gbairai_buzzer.ino
// ── Moteur ──────────────────────────────────────────────────────────────────
const Note* gMel = nullptr;
uint8_t  gMelLen = 0, gMelIdx = 0;
uint32_t gNoteUntil = 0;

void updateMelody() {
  if (!gMel) return;
  uint32_t now = millis();
  if (gNoteUntil && now < gNoteUntil) return;          // note en cours
  if (gMelIdx >= gMelLen) { noTone(BUZZER_PIN); gMel = nullptr; return; }
  const Note& n = gMel[gMelIdx++];
  if (n.freq) tone(BUZZER_PIN, n.freq); else noTone(BUZZER_PIN);
  gNoteUntil = now + n.ms;
}

// Non bloquant. La 1re note est attaquée immédiatement → aucune latence perçue
// sur l'appui du bouton, qui doit rester le retour le plus instantané possible.
void playMelody(const Note* m, uint8_t len) {
  gMel = m; gMelLen = len; gMelIdx = 0; gNoteUntil = 0;
  updateMelody();
}

// Bloquant — uniquement là où loop() est de toute façon à l'arrêt.
void playMelodyNow(const Note* m, uint8_t len) {
  for (uint8_t i = 0; i < len; i++) {
    if (m[i].freq) tone(BUZZER_PIN, m[i].freq); else noTone(BUZZER_PIN);
    delay(m[i].ms);
  }
  noTone(BUZZER_PIN);
}

// Un simple tic ponctuel (décompte du reset d'usine).
void sndTick(uint16_t freq) { tone(BUZZER_PIN, freq, 45); }

// Évite de rejouer la même mélodie si le serveur renvoie deux fois le même état.
LedState gLastSoundState = L_OFFLINE;

void playSoundForState(LedState s) {
  if (s == gLastSoundState) return;
  gLastSoundState = s;
  switch (s) {
    case L_ARMED:  playMelody(MEL(melArmed));  break;
    case L_WINNER: playMelody(MEL(melWinner)); break;
    case L_LOCKED: playMelody(MEL(melLocked)); break;
    case L_REVEAL: playMelody(MEL(melReveal)); break;
    case L_READY:  playMelody(MEL(melReady));  break;
    default: break;
  }
}

void setLedFromState(const String& s) {
  if      (s == "armed")  gLed = L_ARMED;
  else if (s == "winner") gLed = L_WINNER;
  else if (s == "locked") gLed = L_LOCKED;
  else if (s == "reveal") gLed = L_REVEAL;
  else                    gLed = L_READY;   // 'idle' ou inconnu
}

// ============================================================================
//  Parsing minimal des messages (forme fixe → pas besoin d'ArduinoJson)
// ============================================================================
bool jsonHas(const char* p, const char* needle) { return strstr(p, needle) != nullptr; }

// Extrait la valeur texte d'une clé, ex. jsonField(p, "\"state\":\"").
String jsonField(const char* p, const char* keyQuoted) {
  const char* k = strstr(p, keyQuoted);
  if (!k) return "";
  k += strlen(keyQuoted);
  const char* end = strchr(k, '"');
  if (!end) return "";
  return String(k).substring(0, end - k);
}

// ============================================================================
//  Envois
// ============================================================================
void sendHello() {
  // Signale au serveur que ce boot suit un reset d'usine (traçabilité admin) —
  // annoncé une seule fois, puis on ne le répète pas aux hello suivants.
  String m = "{\"type\":\"buzzer_hello\",\"mac\":\"" + gMac + "\",\"firmware\":\"" + FIRMWARE_VERSION + "\""
             + (gJustFactoryReset ? ",\"resetReason\":\"factory\"" : "") + "}";
  webSocket.sendTXT(m);
  gJustFactoryReset = false;
}
void sendBuzz() {
  String m = "{\"type\":\"buzz\",\"source\":\"device\",\"mac\":\"" + gMac + "\"}";
  webSocket.sendTXT(m);
}
void sendTelemetry() {
  if (!gConnected) return;
  String m = "{\"type\":\"device_telemetry\",\"mac\":\"" + gMac + "\",\"battery\":" +
             String(readBatteryPercent()) + ",\"rssi\":" + String(WiFi.RSSI()) + "}";
  webSocket.sendTXT(m);
}

// Mise à jour OTA : télécharge et flashe le firmware depuis l'URL fournie.
// Refusée en cours de partie (on ne coupe jamais un buzzer en plein jeu).
// Remonte au serveur le résultat d'une MAJ (journalisé côté admin).
void sendOtaResult(bool ok, const String& version, const String& err) {
  String m = "{\"type\":\"ota_result\",\"mac\":\"" + gMac + "\",\"ok\":" + (ok ? "true" : "false")
             + ",\"version\":\"" + version + "\"";
  if (!ok) { String e = err; e.replace("\"", "'"); m += ",\"error\":\"" + e + "\""; }
  m += "}";
  webSocket.sendTXT(m);
  webSocket.loop();       // laisse la trame partir avant un éventuel redémarrage
  delay(120);
}

// Mise à jour OTA. Supporte HTTP **et HTTPS** : le binaire est servi par le
// serveur Gbairai lui-même (https://<host>/uploads/firmware/xxx.bin), donc une
// liaison TLS est indispensable — l'ancien WiFiClient simple échouait sur https.
// TLS sans validation de CA (setInsecure) : le flux est chiffré ; l'intégrité est
// garantie par le contrôle de somme/magic byte du bootloader ESP32.
void doOta(const String& url, const String& version) {
  if (url.isEmpty() || inGame()) return;
  Serial.printf("[OTA] mise à jour depuis %s\n", url.c_str());

  gOtaProgress = 0;                          // active le retour visuel dédié
  renderLed();
  playMelodyNow(MEL(melOtaStart));           // « travaux en cours »

  httpUpdate.rebootOnUpdate(false);          // on veut rendre compte AVANT de redémarrer
  httpUpdate.onProgress([](int cur, int total) {
    if (total > 0) gOtaProgress = (cur * 100) / total;
    renderLed();                             // barre de progression sur l'anneau
  });

  t_httpUpdate_return ret;
  if (url.startsWith("https://")) {
    WiFiClientSecure secure;
    secure.setInsecure();                    // pas d'épinglage de CA sur l'appareil
    secure.setTimeout(20000);
    ret = httpUpdate.update(secure, url);
  } else {
    ret = httpUpdate.update(gOtaClient, url);
  }

  gOtaProgress = -1;

  if (ret == HTTP_UPDATE_OK) {
    Serial.println("[OTA] succès → redémarrage");
    sendOtaResult(true, version, "");
    playMelodyNow(MEL(melOtaOk));
    // 3 clignotements verts : succès visible sans câble série.
    for (int i = 0; i < 3; i++) { setAll(rgb(0, 220, 60)); setButtonLed(255); delay(150);
                                  setAll(0); setButtonLed(0); delay(150); }
    ESP.restart();
  } else {
    String err = httpUpdate.getLastErrorString();
    Serial.printf("[OTA] échec (%d) %s\n", httpUpdate.getLastError(), err.c_str());
    sendOtaResult(false, version, err);
    playMelodyNow(MEL(melOtaFail));
    // 3 clignotements rouges : échec identifiable d'un coup d'œil.
    for (int i = 0; i < 3; i++) { setAll(rgb(200, 0, 0)); delay(150);
                                  setAll(0); delay(150); }
  }
}

// ============================================================================
//  Évènements WebSocket
// ============================================================================
void onWsEvent(WStype_t type, uint8_t* payload, size_t length) {
  switch (type) {
    case WStype_CONNECTED:
      gConnected = true;
      gLed = L_READY;
      sendHello();                              // annonce de l'appareil au boot
      sendTelemetry();                          // 1re télémétrie immédiate
      playMelody(MEL(melWsConnect));
      gLastSoundState = L_READY;                // évite un doublon si un 'idle' suit
      Serial.println("[WS] connecté → buzzer_hello");
      break;

    case WStype_DISCONNECTED:
      gConnected = false;
      gLed = L_OFFLINE;
      gLastSoundState = L_OFFLINE;
      playMelody(MEL(melOffline));              // motif descendant : liaison perdue
      Serial.println("[WS] déconnecté");
      break;

    case WStype_TEXT: {
      const char* p = (const char*)payload;
      if (jsonHas(p, "\"awaiting_claim\""))       { gLed = L_AWAITING; gLastSoundState = L_AWAITING; playMelody(MEL(melAwaiting)); Serial.println("[WS] à appairer"); }
      else if (jsonHas(p, "\"pairing_success\"")) { gLed = L_READY;    gLastSoundState = L_READY;    playMelody(MEL(melPaired));   Serial.println("[WS] appairé"); }
      else if (jsonHas(p, "\"type\":\"led\"")) {
        String s = jsonField(p, "\"state\":\"");
        setLedFromState(s);
        playSoundForState(gLed);
        Serial.printf("[WS] led ← %s\n", s.c_str());
      }
      else if (jsonHas(p, "\"type\":\"ota\"")) {  // mise à jour proposée par le serveur
        doOta(jsonField(p, "\"url\":\""), jsonField(p, "\"version\":\""));
      }
      else if (jsonHas(p, "\"type\":\"factory_reset\"")) { // reset distant (admin)
        Serial.println("[WS] reset d'usine demandé par le serveur");
        doFactoryReset();
      }
      break;
    }
    default: break;
  }
}

// ============================================================================
//  Bouton (anti-rebond + front descendant)
// ============================================================================
void handleButton() {
  int b = digitalRead(BUTTON_PIN);
  uint32_t now = millis();
  if (b != gLastBtn && (now - gLastBtnMs) > 40) {   // 40 ms de debounce
    gLastBtnMs = now;
    gLastBtn = b;
    if (b == LOW) {                                 // appui (pull-up → LOW = pressé)
      gPressStartMs = now;                          // départ du chrono d'appui long
      gFlashUntil = now + 180;                      // flash blanc local immédiat
      playMelody(MEL(melPress));                    // impact sec, latence nulle
      if (gConnected) { sendBuzz(); Serial.println("→ BUZZ"); }
    } else {
      gPressStartMs = 0;                            // relâché avant le seuil → rien
      gLastResetTickSec = 0;                        // réarme le décompte sonore
    }
  }

  // Reset d'usine par APPUI LONG (10 s) en fonctionnement : bien plus découvrable
  // que « tenir le bouton au démarrage ». L'anneau et la NeoPixel virent au rouge
  // pendant le décompte, pour que l'utilisateur comprenne ce qui va se passer.
  if (gPressStartMs && b == LOW) {
    uint32_t held = now - gPressStartMs;
    if (held > 3000) {                              // à partir de 3 s : avertissement visuel
      bool tick = (now / 150) % 2;
      setAll(tick ? rgb(220, 0, 0) : rgb(20, 0, 0));
      setButtonLed(tick ? 255 : 0);

      // Décompte SONORE : un tic par seconde, de plus en plus aigu à mesure que
      // l'effacement approche. On entend le reset arriver — et on peut relâcher.
      uint8_t sec = held / 1000;                    // 3,4,5… jusqu'à 10
      if (sec != gLastResetTickSec) {
        gLastResetTickSec = sec;
        sndTick(400 + (uint16_t)sec * 90);
      }
    }
    if (held >= LONG_PRESS_RESET_MS) {
      Serial.println("[RESET] appui long → reset d'usine");
      doFactoryReset();                             // efface, puis redémarre
    }
  }
}

// ============================================================================
//  Configuration Wi-Fi + serveur (captive portal)
// ============================================================================
void startPortalIfNeeded() {
  WiFiManager wm;
  // Le portail ne demande QUE le Wi-Fi (SSID + mot de passe). Le serveur Gbairai
  // est codé en dur (GBAIRAI_HOST/PORT) → aucune saisie technique pour l'utilisateur.
  gLed = L_PORTAL;
  // ⚠️ autoConnect()/startConfigPortal() sont BLOQUANTS : loop() — et donc
  // renderLed() — ne tourne pas tant que le Wi-Fi n'est pas configuré. Sans le
  // rendu explicite ci-dessous, le bandeau restait ÉTEINT pendant toute la
  // configuration (le « blanc pulsé » n'apparaissait jamais). On allume donc en
  // blanc fixe avant de bloquer, et on le ré-affirme quand le point d'accès
  // démarre réellement (setAPCallback), seul moment où WiFiManager nous rend la main.
  setAll(rgb(255, 255, 255));
  setButtonLed(255);
  playMelodyNow(MEL(melPortal));   // bloquant : loop() ne tourne pas pendant le portail

