BigZ2000/gbairai/tools/firmware-esp32/gbairai_buzzer/gbairai_buzzer.ino
  // Nom du point d'accès de configuration : "Gbairai-Buzzer-XXXX".
  String ap = "Gbairai-Buzzer-" + gMac.substring(gMac.length() - 5);
  ap.replace(":", "");
  wm.setConfigPortalTimeout(180);                   // 3 min puis re-tentative
  wm.setAPCallback([](WiFiManager*) {               // le portail vient de s'ouvrir
    Serial.println("[WiFi] portail ouvert → connecte-toi au Wi-Fi Gbairai-Buzzer-…");
    setAll(rgb(255, 255, 255));
    setButtonLed(255);
  });

  // Drapeau posé par doFactoryReset() : garantit l'ouverture du portail même si
  // l'effacement des identifiants Wi-Fi (NVS) avait échoué silencieusement —
  // bug connu de certaines combinaisons ESP32 core / WiFiManager où resetSettings()
  // ne prend pas effet si le pilote Wi-Fi n'était pas déjà démarré au moment du reset.
  prefs.begin("gbairai", false);
  bool forcePortal = prefs.getBool("force_portal", false);
  prefs.end();
  gJustFactoryReset = forcePortal;

  bool ok;
  if (forcePortal) {
    Serial.println("[WiFi] reset récent → portail forcé (identifiants connus ignorés)");
    ok = wm.startConfigPortal(ap.c_str());
  } else {
    // autoConnect : reconnecte au Wi-Fi connu, sinon ouvre le portail (bloquant).
    ok = wm.autoConnect(ap.c_str());
  }
  if (!ok) {
    // Le drapeau n'est PAS consommé ici : si l'utilisateur n'a pas eu le temps de
    // configurer (ou coupe le courant), le prochain boot rouvrira bien le portail.
    Serial.println("[WiFi] échec portail → redémarrage");
    delay(2000); ESP.restart();
  }

  // Configuration réussie → on peut consommer le drapeau en toute sécurité.
  if (forcePortal) {
    prefs.begin("gbairai", false);
    prefs.putBool("force_portal", false);
    prefs.end();
  }

  // EXTINCTION EXPLICITE DU POINT D'ACCÈS. WiFiManager laisse parfois la carte en
  // mode AP_STA après une configuration réussie : le réseau « Gbairai-Buzzer-XXXX »
  // resterait alors visible et connectable en permanence (confusion pour les
  // joueurs, et surface d'attaque inutile). On force donc le mode station seule.
  WiFi.softAPdisconnect(true);
  WiFi.mode(WIFI_STA);
  playMelodyNow(MEL(melWifiOk));    // « Wi-Fi obtenu » avant de rendre la main à loop()

  Serial.printf("[WiFi] connecté (%s) — point d'accès éteint. Serveur = %s:%u\n",
                WiFi.localIP().toString().c_str(), GBAIRAI_HOST, GBAIRAI_PORT);
}

// Effacement Wi-Fi + config puis redémarrage (rouvre le portail au reboot).
// Appelé soit par le bouton tenu au boot, soit par la commande serveur (admin).
void doFactoryReset() {
  Serial.println("[RESET] effacement Wi-Fi/config");

  // Ceinture ET bretelles : sur certaines combinaisons ESP32 core / WiFiManager,
  // wm.resetSettings() seul peut échouer à effacer les identifiants en NVS si le
  // pilote Wi-Fi n'a pas encore été démarré à cet instant (ex. reset physique au
  // tout premier boot). On force explicitement le driver puis l'effacement NVS
  // AVANT d'appeler resetSettings(), qui repasse derrière en confirmation.
  WiFi.mode(WIFI_STA);
  WiFi.disconnect(true, true);        // (wifioff, eraseAP) → efface les identifiants NVS
  delay(300);
  WiFiManager wm; wm.resetSettings();
  delay(200);

  // Drapeau "portail forcé" : même si l'effacement ci-dessus échouait malgré
  // tout, le prochain boot ouvrira le portail sans tenter l'ancien Wi-Fi.
  prefs.begin("gbairai", false);
  prefs.clear();
  prefs.putBool("force_portal", true);
  prefs.end();

  playMelodyNow(MEL(melResetDone));          // motif descendant : effacement
  // clignotement rouge de confirmation
  for (int i = 0; i < 6; i++) { setAll(rgb(180,0,0)); delay(120);
                                setAll(0); delay(120); }
  ESP.restart();
}

// Reset d'usine : bouton maintenu enfoncé au démarrage → efface Wi-Fi + config.
void maybeFactoryReset() {
  if (digitalRead(BUTTON_PIN) == LOW) {
    Serial.println("[RESET] bouton maintenu au boot");
    doFactoryReset();
  }
}

// ============================================================================
//  Setup / Loop
// ============================================================================
void setup() {
  Serial.begin(115200);
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  // Luminosité volontairement modérée : une WS2812 tire ~60 mA en blanc plein.
  // Avec LED_COUNT=7 cela ferait ~420 mA — bien trop pour la broche 3V3 de la
  // carte, surtout pendant les pics d'émission Wi-Fi (risque de brownout/reset).
  // À 90/255 on plafonne autour de ~150 mA, ce qui reste sûr. Si tu alimentes le
  // bandeau en 5 V (VIN) avec sa propre masse, tu peux remonter jusqu'à 160–255.
  pixel.begin(); pixel.setBrightness(LED_COUNT > 1 ? 90 : 160); pixel.show();

  // Anneau lumineux du bouton arcade (4 broches) piloté en PWM via transistor.
#if BUTTON_LED_PIN >= 0
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcAttach(BUTTON_LED_PIN, BTN_LED_FREQ, BTN_LED_RES);
  #else
    ledcSetup(BTN_LED_CHANNEL, BTN_LED_FREQ, BTN_LED_RES);
    ledcAttachPin(BUTTON_LED_PIN, BTN_LED_CHANNEL);
  #endif
  setButtonLed(0);
#endif

  gMac = WiFi.macAddress();           // "AA:BB:CC:DD:EE:FF" (majuscules)
  gMac.toUpperCase();
  Serial.printf("\nGbairai Buzzer — MAC %s\n", gMac.c_str());

  playMelodyNow(MEL(melBoot));        // petit réveil sonore : « je suis vivant »

  maybeFactoryReset();                // reset d'usine si bouton tenu au boot
  startPortalIfNeeded();              // Wi-Fi (captive portal au 1er démarrage)

  // Connexion WebSocket au serveur codé en dur (chemin "/" — le serveur accepte tout chemin).
  // Port 443 → WSS (TLS, prod cloud) ; sinon WS clair (LAN). Sur ESP32, beginSSL
  // sans CA chiffre la liaison sans valider le certificat (suffisant ici ;
  // durcissement futur = épingler la CA Let's Encrypt via beginSslWithCA).
  if (GBAIRAI_PORT == 443) {
    Serial.println("[WS] liaison sécurisée (wss)");
    webSocket.beginSSL(GBAIRAI_HOST, GBAIRAI_PORT, "/");
  } else {
    webSocket.begin(GBAIRAI_HOST, GBAIRAI_PORT, "/");
  }
  webSocket.onEvent(onWsEvent);
  webSocket.setReconnectInterval(3000);   // reconnexion auto toutes les 3 s
  webSocket.enableHeartbeat(15000, 3000, 2);
}

void loop() {
  webSocket.loop();
  handleButton();
  renderLed();
  updateMelody();          // fait avancer la mélodie en cours (jamais de delay)
  // Télémétrie périodique (batterie + signal Wi-Fi).
  if (millis() - gLastTelemetryMs > TELEMETRY_MS) { gLastTelemetryMs = millis(); sendTelemetry(); }
}
